1. Importa le librerie necessarie

In [ ]:
import pandas as pd

2. Importa il dataframe da questo [link](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [ ]:
df=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep = '|')
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

3. Seleziona solo la colonna age

In [ ]:
df[["age"]]

     age
0     24
1     53
2     23
3     24
4     33
..   ...
938   26
939   32
940   20
941   48
942   22

[943 rows x 1 columns]

4. Crea un dataframe chiamato worker con solo le colonne age e occupation e visualizzale

In [ ]:
worker = df[["age","occupation"]]
worker

     age     occupation
0     24     technician
1     53          other
2     23         writer
3     24     technician
4     33          other
..   ...            ...
938   26        student
939   32  administrator
940   20        student
941   48      librarian
942   22        student

[943 rows x 2 columns]

5. Calcola l' età media

In [ ]:
df["age"].mean()

34.05196182396607

6. Filtra gli users con età maggiori di 50

In [ ]:
df[df["age"] > 50]

     user_id  age gender     occupation zip_code
1          2   53      F          other    94043
6          7   57      M  administrator    91344
9         10   53      M         lawyer    90703
46        47   53      M      marketing    07102
64        65   51      F       educator    48118
..       ...  ...    ...            ...      ...
899      900   60      M        retired    18505
911      912   51      M          other    06512
930      931   60      M       educator    33556
931      932   58      M       educator    06437
933      934   61      M       engineer    22902

[105 rows x 5 columns]

7. Seleziona le occupazioni che iniziano con la 'a'

In [ ]:
df[df.occupation.str.startswith("a")]

     user_id  age gender     occupation zip_code
6          7   57      M  administrator    91344
7          8   36      M  administrator    05201
22        23   30      F         artist    48197
23        24   21      F         artist    94533
30        31   24      M         artist    10003
..       ...  ...    ...            ...      ...
890      891   51      F  administrator    03062
901      902   45      F         artist    97203
919      920   30      F         artist    90008
921      922   29      F  administrator    21114
939      940   32      M  administrator    02215

[107 rows x 5 columns]

8. Seleziona le prime 7 colonne del dataframe

In [ ]:
df.head(7)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344

9. Presenta solo le occupazione dei users di 23-24 anni

In [ ]:
df[(df.age < 22) & (df.age < 25)]["occupation"]

15     entertainment
23            artist
29           student
34         homemaker
35           student
           ...
920          student
922          student
924         salesman
927          student
940          student
Name: occupation, Length: 136, dtype: object